modules/gateway/server/src/test/resources/com/l7tech/server/wsman/createEchoHeadersService.xml

<!-- Creates a service which returns the request headers in the response body -->
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:n1="http://ns.l7tech.com/2010/04/gateway-management" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
	<s:Header>
		<wsa:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</wsa:Action>
		<wsa:To s:mustUnderstand="true">http://127.0.0.1:8080/wsman</wsa:To>
		<wsman:ResourceURI s:mustUnderstand="true">http://ns.l7tech.com/2010/04/gateway-management/services</wsman:ResourceURI>
		<wsa:MessageID s:mustUnderstand="true">uuid:a711f948-7d39-1d39-8002-481688002100</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</s:Header>
	<s:Body>
		 <n1:Service type="soap">
         <n1:ServiceDetail>
            <n1:Name>EchoHeaders</n1:Name>
            <n1:Enabled>true</n1:Enabled>
            <n1:ServiceMappings>
               <n1:HttpMapping>
                  <n1:UrlPattern>/echoHeaders</n1:UrlPattern>
                  <n1:Verbs>
                     <n1:Verb>GET</n1:Verb>
                     <n1:Verb>POST</n1:Verb>
                     <n1:Verb>PUT</n1:Verb>
                     <n1:Verb>DELETE</n1:Verb>
                  </n1:Verbs>
               </n1:HttpMapping>
               <n1:SoapMapping>
                  <n1:Lax>true</n1:Lax>
               </n1:SoapMapping>
            </n1:ServiceMappings>
         </n1:ServiceDetail>
         <n1:Resources>
           <n1:ResourceSet tag="policy">
               <n1:Resource type="policy" version="5"><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
               <wsp:Policy xmlns:L7p="http://www.layer7tech.com/ws/policy" xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy">
                   <wsp:All wsp:Usage="Required">
                       <L7p:SetVariable>
                           <L7p:Base64Expression stringValue=""/>
                           <L7p:VariableToSet stringValue="headers"/>
                       </L7p:SetVariable>
                       <L7p:ForEachLoop L7p:Usage="Required" loopVariable="request.http.headernames" variablePrefix="name">
                           <L7p:LookupDynamicContextVariables>
                               <L7p:SourceVariable stringValue="request.http.header.${name.current}"/>
                               <L7p:TargetDataType variableDataType="string"/>
                               <L7p:TargetOutputVariablePrefix stringValue="value"/>
                           </L7p:LookupDynamicContextVariables>
                           <wsp:OneOrMore wsp:Usage="Required">
                               <wsp:All wsp:Usage="Required">
                                   <L7p:ComparisonAssertion>
                                       <L7p:Expression1 stringValue="${headers}"/>
                                       <L7p:Expression2 stringValue=""/>
                                       <L7p:Operator operator="EMPTY"/>
                                       <L7p:Predicates predicates="included">
                                           <L7p:item binary="included">
                                               <L7p:Operator operator="EMPTY"/>
                                               <L7p:RightValue stringValue=""/>
                                           </L7p:item>
                                       </L7p:Predicates>
                                   </L7p:ComparisonAssertion>
                                   <L7p:SetVariable>
                                       <L7p:Base64Expression stringValue="JHtuYW1lLmN1cnJlbnR9OiR7dmFsdWUub3V0cHV0fQ=="/>
                                       <L7p:VariableToSet stringValue="headers"/>
                                   </L7p:SetVariable>
                               </wsp:All>
                               <L7p:SetVariable>
                                   <L7p:Base64Expression stringValue="JHtoZWFkZXJzfQ0KJHtuYW1lLmN1cnJlbnR9OiR7dmFsdWUub3V0cHV0fQ=="/>
                                   <L7p:VariableToSet stringValue="headers"/>
                               </L7p:SetVariable>
                           </wsp:OneOrMore>
                       </L7p:ForEachLoop>
                       <L7p:HardcodedResponse>
                           <L7p:Base64ResponseBody stringValue="PGFsbD4KJHtyZXF1ZXN0Lmh0dHAuYWxsaGVhZGVydmFsdWVzfQo8L2FsbD4KPGJ5TmFtZT4KJHtoZWFkZXJzfQo8L2J5TmFtZT4="/>
                       </L7p:HardcodedResponse>
                   </wsp:All>
               </wsp:Policy>
               ]]></n1:Resource>
            </n1:ResourceSet>
         </n1:Resources>
      </n1:Service>
	</s:Body>
</s:Envelope>